Catalogs/НомераПроизводственныхПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>НомераПроизводственныхПартий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПроизводственныеПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПроизводственныеПартии</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗавершеноПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторТранзакции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыПроизводственныхТранзакций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПартии</Name>
					<Comment>Номер производственной партии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераПроизводственныхПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НомераПроизводственныхПартий/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФорм

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ИспользоватьКонтрольПартийПриНезавершенномПроизводстве") Тогда
		ИспользоватьКонтрольПартийПриНезавершенномПроизводстве = Параметры.ИспользоватьКонтрольПартийПриНезавершенномПроизводстве;
	КонецЕсли;
	
	Если ИспользоватьКонтрольПартийПриНезавершенномПроизводстве Тогда
		
		УстановитьТекстЗапросаПриКонтролеПартий();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьТекстЗапросаПриКонтролеПартий()

	Список.ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникНомераПроизводственныхПартий.Ссылка КАК Ссылка,
		|	СправочникНомераПроизводственныхПартий.ПометкаУдаления КАК ПометкаУдаления,
		|	СправочникНомераПроизводственныхПартий.Код КАК Код,
		|	СправочникНомераПроизводственныхПартий.Наименование КАК Наименование,
		|	СправочникНомераПроизводственныхПартий.Предопределенный КАК Предопределенный,
		|	СправочникНомераПроизводственныхПартий.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.НомераПроизводственныхПартий КАК СправочникНомераПроизводственныхПартий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроизводственныеПартии.СрезПоследних(
		|				,
		|				Организация = &Организация
		|					И Предприятие = &Предприятие) КАК ПроизводственныеПартииСрезПоследних
		|		ПО СправочникНомераПроизводственныхПартий.Ссылка = ПроизводственныеПартииСрезПоследних.НомерПартии
		|ГДЕ
		|	(ПроизводственныеПартииСрезПоследних.ИдентификаторТранзакции = &ИдентификаторТранзакции
		|				И НЕ ПроизводственныеПартииСрезПоследних.ЗавершеноПроизводство
		|			ИЛИ ПроизводственныеПартииСрезПоследних.НомерПартии ЕСТЬ NULL)";
	
	Если Параметры.Свойство("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Организация", Параметры.Организация);
	КонецЕсли;
	
	Если Параметры.Свойство("Предприятие") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Предприятие", Параметры.Предприятие);
	КонецЕсли;
	
	Если Параметры.Свойство("ИдентификаторТранзакции") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ИдентификаторТранзакции", Параметры.ИдентификаторТранзакции);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
